#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform-scripts relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/quarkiverse-devops/quarkiverse-devops/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/quarkiverse-devops/quarkiverse-devops

To view this run in a browser, visit:
https://app.terraform.io/app/quarkiverse/quarkiverse-devops/runs/run-7QczdH8ZPHiWZVqe

Waiting for the plan to start...

Terraform v1.11.4
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.quarkus_operator_sdk will be updated in-place
  ~ resource "github_repository" "quarkus_operator_sdk" {
      ~ allow_merge_commit          = false -> true
        id                          = "quarkus-operator-sdk"
        name                        = "quarkus-operator-sdk"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # github_repository.quarkus_oras will be created
  + resource "github_repository" "quarkus_oras" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Quarkus Extension for ORAS Java SDK"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + homepage_url                = "https://docs.quarkiverse.io/quarkus-oras/dev"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "quarkus-oras"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "oci",
          + "oras",
          + "quarkus-extension",
        ]
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.quarkus_primefaces will be updated in-place
  ~ resource "github_repository" "quarkus_primefaces" {
      ~ description                 = "Quarkus PrimeFaces Extension" -> "Quarkus PrimeFaces Faces (JSF) Extension"
        id                          = "quarkus-primefaces"
        name                        = "quarkus-primefaces"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_resteasy_problem will be updated in-place
  ~ resource "github_repository" "quarkus_resteasy_problem" {
        id                          = "quarkus-resteasy-problem"
        name                        = "quarkus-resteasy-problem"
      ~ topics                      = [
          - "openapi",
          - "problem-details",
          - "problem-details-for-http-apis",
          - "rest-api",
            # (6 unchanged elements hidden)
        ]
        # (36 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_ruleset.quarkus_oras will be created
  + resource "github_repository_ruleset" "quarkus_oras" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "main"
      + node_id     = (known after apply)
      + repository  = "quarkus-oras"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 995364
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + non_fast_forward              = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 0
              + required_review_thread_resolution = false
            }
        }
    }

  # github_team.quarkus_oras will be created
  + resource "github_team" "quarkus_oras" {
      + create_default_maintainer = false
      + description               = "oras team"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "quarkiverse-oras"
      + node_id                   = (known after apply)
      + parent_team_id            = "5344029"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.quarkus_discord4j["cottoncammy"] will be created
  + resource "github_team_membership" "quarkus_discord4j" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "6732488"
      + username = "cottoncammy"
    }

  # github_team_membership.quarkus_oras["jonesbusy"] will be created
  + resource "github_team_membership" "quarkus_oras" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "jonesbusy"
    }

  # github_team_repository.quarkus_oras will be created
  + resource "github_team_repository" "quarkus_oras" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "quarkus-oras"
      + team_id    = (known after apply)
    }

Plan: 6 to add, 3 to change, 0 to destroy.

```

*Pusher: @gastaldi, Action: `pull_request`, Workflow: `Terraform`*